; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v8)
             (pred_8 ?v7 ?v4)
             (pred_7 ?v12 ?v4)
             (pred_5 ?v10 ?v12 )
	     (pred_6 ?v12)
             (pred_10 ?v6)
             (pred_12 ?v7)
             (pred_2 ?v4)
             (pred_11 ?v12)
             (pred_9 ?v7)
             (pred_1 ?v12)
             (pred_4 ))



(:action op_2
:parameters (?v5 ?v1 ?v9 ?v2)
:precondition (and (pred_10 ?v5) (pred_10 ?v1) (pred_12 ?v9) (pred_2 ?v2)
          (pred_3 ?v5 ?v1) (pred_8 ?v9 ?v2)
                   (pred_7 ?v1 ?v2) (pred_6 ?v5) 
                   (pred_11 ?v1) (pred_9 ?v9))
:effect (and  (pred_1 ?v1) (not (pred_11 ?v1))))


(:action op_1
:parameters (?v5 ?v3)
:precondition (and (pred_10 ?v5) (pred_10 ?v3)
               (pred_6 ?v5) (pred_3 ?v5 ?v3) (pred_1 ?v3))
:effect (and (pred_6 ?v3) (not (pred_6 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_10 ?v5) (pred_12 ?v9) 
                  (pred_6 ?v5) (pred_5 ?v9 ?v5) (pred_4 ))
:effect (and (pred_9 ?v9)
   (not (pred_5 ?v9 ?v5)) (not (pred_4 ))))


(:action op_3
:parameters (?v5 ?v11 ?v13)
:precondition (and (pred_10 ?v5) (pred_12 ?v11) (pred_12 ?v13)
                  (pred_6 ?v5) (pred_9 ?v13) (pred_5 ?v11 ?v5))
:effect (and (pred_9 ?v11) (pred_5 ?v13 ?v5)
        (not (pred_9 ?v13)) (not (pred_5 ?v11 ?v5))))

(:action op_5
:parameters (?v5 ?v9)
:precondition (and (pred_10 ?v5) (pred_12 ?v9) 
                  (pred_6 ?v5) (pred_9 ?v9))
:effect (and (pred_4 ) (pred_5 ?v9 ?v5) (not (pred_9 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_29 obj_12 obj_15 obj_18 obj_02 obj_04 obj_09 obj_07 obj_24 obj_10 obj_21 obj_26 obj_08 obj_28 obj_14 obj_27 obj_20 obj_30 obj_16 obj_13 obj_17 obj_01 obj_19 obj_23 obj_03
    obj_25 obj_06 obj_31
    obj_05 obj_32 obj_22 obj_11
    )

    (:init
       (pred_4)

       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_24)
       (pred_10 obj_10)
       (pred_10 obj_21)
       (pred_10 obj_26)
       (pred_10 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_27)
       (pred_10 obj_20)
       (pred_10 obj_30)
       (pred_10 obj_16)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_10 obj_23)
       (pred_10 obj_03)
       (pred_2 obj_25)
       (pred_2 obj_06)
       (pred_2 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_32)
       (pred_12 obj_22)
       (pred_12 obj_11)

       (pred_3 obj_29 obj_04)
       (pred_3 obj_29 obj_12)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_29)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_04 obj_21)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_04 obj_29)
       (pred_3 obj_09 obj_26)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_07 obj_08)
       (pred_3 obj_07 obj_24)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_24 obj_28)
       (pred_3 obj_24 obj_10)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_24 obj_07)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_24)
       (pred_3 obj_21 obj_27)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_04)
       (pred_3 obj_26 obj_20)
       (pred_3 obj_26 obj_08)
       (pred_3 obj_26 obj_09)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_08 obj_28)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_08 obj_26)
       (pred_3 obj_28 obj_16)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_24)
       (pred_3 obj_28 obj_08)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_27 obj_17)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_27 obj_21)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_20 obj_30)
       (pred_3 obj_20 obj_26)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_30 obj_19)
       (pred_3 obj_30 obj_16)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_30 obj_20)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_28)
       (pred_3 obj_16 obj_30)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_27)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_19 obj_23)
       (pred_3 obj_19 obj_30)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_23 obj_03)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_23 obj_19)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_23)
       (pred_11 obj_17)
       (pred_11 obj_04)
       (pred_11 obj_26)
       (pred_11 obj_23)
       (pred_7  obj_17 obj_25)
       (pred_7  obj_04 obj_06)
       (pred_7  obj_26 obj_31)
       (pred_7  obj_23 obj_25)
       (pred_1 obj_29)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_24)
       (pred_1 obj_10)
       (pred_1 obj_21)
       (pred_1 obj_08)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_27)
       (pred_1 obj_20)
       (pred_1 obj_30)
       (pred_1 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_03)

       (pred_8  obj_05 obj_25)
       (pred_8  obj_32 obj_06)
       (pred_8  obj_22 obj_31)
       (pred_8  obj_11 obj_25)
       (pred_5 obj_05 obj_28)
       (pred_5 obj_32 obj_20)
       (pred_5 obj_22 obj_04)
       (pred_5 obj_11 obj_13)
       (pred_6 obj_20)
    )

    (:goal (and
       (pred_5 obj_11 obj_20)
    ))
(:constraints
  (always (not (pred_6 obj_16)))
)
)

; plan
1. (op_1 obj_20 obj_30)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_30)
   goals met: 0 of 1
2. (op_1 obj_30 obj_08)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_28)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_28)
   goals met: 0 of 1
4. (op_1 obj_28 obj_14)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_14)
   goals met: 0 of 1
5. (op_1 obj_14 obj_13)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_13)
   goals met: 0 of 1
6. (op_4 obj_13 obj_11)
   deleted: (pred_5 obj_11 obj_13) (pred_4)
   added: (pred_9 obj_11)
   goals met: 0 of 1
7. (op_1 obj_13 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_14)
   goals met: 0 of 1
8. (op_1 obj_14 obj_28)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_28)
   goals met: 0 of 1
9. (op_1 obj_28 obj_08)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_08)
   goals met: 0 of 1
10. (op_1 obj_08 obj_30)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_30)
   goals met: 0 of 1
11. (op_1 obj_30 obj_20)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_20)
   goals met: 0 of 1
12. (op_3 obj_20 obj_32 obj_11)
   deleted: (pred_9 obj_11) (pred_5 obj_32 obj_20)
   added: (pred_9 obj_32) (pred_5 obj_11 obj_20)
   goals met: 1 of 1
